In [1]:
import pandas as pd

In [3]:
import numpy as np
import pandas as pd
import os
import matplotlib.pyplot as plt
%matplotlib inline

In [5]:
titanic_train = pd.read_csv("https://gist.githubusercontent.com/michhar/2dfd2de0d4f8727f873422c5d959fff5/raw/ff414a1bcfcba32481e4d4e8db578e55872a2ca1/titanic.csv",
                           sep='\t')   
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [6]:
titanic_train.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,113776,66.6000,C2,S
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,A.5. 11206,8.0500,NaN,S
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,A/5. 851,14.5000,NaN,S
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,Fa 265302,7.3125,NaN,S
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,PC 17597,61.3792,NaN,C

In [20]:
#Extracting the data with list of Column names
titanic_train[['Embarked',"Survived",'Pclass']]

    Embarked  Survived  Pclass
0          S         0       3
1          C         1       1
2          S         1       3
3          S         1       1
4          S         0       3
..       ...       ...     ...
151        S         1       1
152        S         0       3
153        S         0       3
154        S         0       3
155        C         0       1

[156 rows x 3 columns]

In [7]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [10]:
titanic_train.dtypes == 'object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool

In [9]:
type(titanic_train.dtypes == 'object') # one or column i.e Series

pandas.core.series.Series

In [13]:
titanic_train.dtypes[titanic_train.dtypes == "object"] # Printing data and Index

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [16]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index # Extrating indexes

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [17]:
titanic_train.dtypes[titanic_train.dtypes == "int64"] # Extracting the int64 type Column name

PassengerId    int64
Survived       int64
Pclass         int64
SibSp          int64
Parch          int64
dtype: object

In [18]:
titanic_train.dtypes[titanic_train.dtypes == "int64"].index

Index(['PassengerId', 'Survived', 'Pclass', 'SibSp', 'Parch'], dtype='object')

In [22]:
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [25]:
# Extracting the object type column names
titanic_train.dtypes == "object"
a = titanic_train.dtypes[titanic_train.dtypes == "object"].index
a
titanic_train[a].head()

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S

In [27]:
# Count gives number of dataset available in the respective column
# Unique gives unique values in the respective column
# Freq gives number of occurences in the column
# Describe() only on column data type of Object
titanic_train[a].describe()

                        Name   Sex      Ticket        Cabin Embarked
count                    156   156         156           31      155
unique                   156     2         145           28        3
top     Fynney, Mr. Joseph J  male  W./C. 6608  C23 C25 C27        S
freq                       1   100           2            2      110

In [33]:
# Describe() on all columns of interger data type and float type
titanic_train.describe() # by default it will pick numerical data type columns 
# Count of all data set in the respective column
# mean gives avarage all the dataset in respective column

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [34]:
titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [35]:
titanic_train.dtypes[titanic_train.dtypes == "object"]


titanic_train.dtypes[titanic_train.dtypes == "object"].index

Index(['Name', 'Sex', 'Ticket', 'Cabin', 'Embarked'], dtype='object')

In [36]:
titanic_train.dtypes[titanic_train.dtypes == "object"]

Name        object
Sex         object
Ticket      object
Cabin       object
Embarked    object
dtype: object

In [37]:
list_col = titanic_train.dtypes[titanic_train.dtypes == "object"].index
titanic_train[list_col].describe()

                        Name   Sex      Ticket        Cabin Embarked
count                    156   156         156           31      155
unique                   156     2         145           28        3
top     Fynney, Mr. Joseph J  male  W./C. 6608  C23 C25 C27        S
freq                       1   100           2            2      110

In [38]:
titanic_train[['Name','Sex','Age']]

                                                  Name     Sex   Age
0                              Braund, Mr. Owen Harris    male  22.0
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0
2                               Heikkinen, Miss. Laina  female  26.0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0
4                             Allen, Mr. William Henry    male  35.0
..                                                 ...     ...   ...
151                  Pears, Mrs. Thomas (Edith Wearne)  female  22.0
152                                   Meo, Mr. Alfonzo    male  55.5
153                    van Billiard, Mr. Austin Blyler    male  40.5
154                              Olsen, Mr. Ole Martin    male   NaN
155                        Williams, Mr. Charles Duane    male  51.0

[156 rows x 3 columns]

In [40]:
titanic_train.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [41]:
titanic_train['Name']

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
151                    Pears, Mrs. Thomas (Edith Wearne)
152                                     Meo, Mr. Alfonzo
153                      van Billiard, Mr. Austin Blyler
154                                Olsen, Mr. Ole Martin
155                          Williams, Mr. Charles Duane
Name: Name, Length: 156, dtype: object

In [42]:
type(titanic_train['Name'])

pandas.core.series.Series

In [44]:
# Sorting the data for particular column
sorted(titanic_train['Name'])

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Allen, Mr. William Henry',
 'Andersson, Miss. Ellis Anna Maria',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Mr. Anders Johan',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andreasson, Mr. Paul Edvin',
 'Andrew, Mr. Edgardo Samuel',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Attalah, Miss. Malake',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Barton, Mr. David John',
 'Bateman, Rev. Robert James',
 'Baxter, Mr. Quigg Edmond',
 'Beesley, Mr. Lawrence',
 'Bing, Mr. Lee',
 'Bonnell, Miss. Elizabeth',
 'Boulos, Mrs. Joseph (Sultana)',
 'Braund, Mr. Owen Harris',
 'Burke, Mr. Jeremiah',
 'Byles, Rev. Thomas Roussel Davids',
 'Caldwell, Master. Alden Gates',
 'Cann, Mr. Ernest Charles',
 'Carrau, Mr. Francisco M',
 'Celotti, Mr. Francesco',
 'Chaffee, Mr. Herbert Fuller',
 'Christmann, Mr. Emil',
 'Chronopoulos, Mr. Apostolos',
 'Coelho, Mr. Domingos Fernandeo',
 'Connors, Mr. Patrick',
 'Coxon, Mr. Daniel',
 'Crease, Mr. Ernest James',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Dean, Mr. Bertram Frank',
 'Devaney, Miss. Margaret Delia',
 'Doling, Mrs. John T (Ada Julia Bone)',
 'Dowdell, Miss. Elizabeth',
 'Drazenoic, Mr. Jozef',
 'Ekstrom, Mr. Johan',
 'Emir, Mr. Farred Chehab',
 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)',
 'Ford, Miss. Robina Maggie "Ruby"',
 'Ford, Mr. William Neal',
 'Fortune, Miss. Mabel Helen',
 'Fortune, Mr. Charles Alexander',
 'Futrelle, Mr. Jacques Heath',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Fynney, Mr. Joseph J',
 'Giglio, Mr. Victor',
 'Glynn, Miss. Mary Agatha',
 'Goldschmidt, Mr. George B',
 'Goodwin, Master. William Frederick',
 'Goodwin, Miss. Lillian Amy',
 'Greenfield, Mr. William Bertram',
 'Gustafsson, Mr. Anders Vilhelm',
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
 'Harper, Mrs. Henry Sleeper (Myna Haxtun)',
 'Harris, Mr. Henry Birkhardt',
 'Heikkinen, Miss. Laina',
 'Hewlett, Mrs. (Mary D Kingcome) ',
 'Hickman, Mr. Stanley George',
 'Holverson, Mr. Alexander Oskar',
 'Hood, Mr. Ambrose Jr',
 'Icard, Miss. Amelie',
 'Ilett, Miss. Bertha',
 'Jenkin, Mr. Stephen Curnow',
 'Johansson, Mr. Gustaf Joel',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Jussila, Miss. Katriina',
 'Kantor, Mr. Sinai',
 'Kink, Mr. Vincenz',
 'Kraeff, Mr. Theodor',
 'Laroche, Miss. Simonne Marie Anne Andree',
 'Lennon, Mr. Denis',
 'Madsen, Mr. Fridtjof Arne',
 'Mamee, Mr. Hanna',
 'Masselmani, Mrs. Fatima',
 'McCarthy, Mr. Timothy J',
 'McDermott, Miss. Brigdet Delia',
 'McGowan, Miss. Anna "Annie"',
 'McMahon, Mr. Martin',
 'Meo, Mr. Alfonzo',
 'Meyer, Mr. Edgar Joseph',
 'Mionoff, Mr. Stoytcho',
 'Moen, Mr. Sigurd Hansen',
 'Moore, Mr. Leonard Charles',
 'Moran, Miss. Bertha',
 'Moran, Mr. James',
 'Moss, Mr. Albert Johan',
 'Moubarek, Master. Gerios',
 'Moutal, Mr. Rahamin Haim',
 'Nasser, Mr. Nicholas',
 'Nasser, Mrs. Nicholas (Adele Achem)',
 'Navratil, Mr. Michel ("Louis M Hoffman")',
 'Newsom, Miss. Helen Monypeny',
 'Nicholls, Mr. Joseph Charles',
 'Nicola-Yarred, Master. Elias',
 'Nicola-Yarred, Miss. Jamila',
 'Nosworthy, Mr. Richard Cater',
 'Novel, Mr. Mansouer',
 'Nye, Mrs. (Elizabeth Ramell)',
 'Nysten, Miss. Anna Sofia',
 "O'Driscoll, Miss. Bridget",
 'O\'Dwyer, Miss. Ellen "Nellie"',
 'Olsen, Mr. Ole Martin',
 'Osen, Mr. Olaf Elon',
 'Ostby, Mr. Engelhart Cornelius',
 'Palsson, Master. Gosta Leonard',
 'Palsson, Miss. Torborg Danira',
 'Panula, Master. Juha Niilo',
 'Pears, Mrs. Thomas (Edith Wearne)',
 'Pekoniemi, Mr. Edvard',
 'Peter, Miss. Anna',
 'Petranec, Miss. Matilda',
 'Petroff, Mr. Pastcho ("Pentcho")',
 'Porter, Mr. Walter Chamberlain',
 'Rekic, Mr. Tido',
 'Rice, Master. Eugene',
 'Richard, Mr. Emile',
 'Robins, Mrs. Alexander A (Grace Charity Laury)',
 'Rogers, Mr. William John',
 'Rugg, Miss. Emily',
 'Salkjelsvik, Miss. Anna Kristine',
 'Samaan, Mr. Youssef',
 'Sandstrom, Miss. Marguerite Rut',
 'Saundercock, Mr. William Henry',
 'Sheerlinck, Mr. Jan Baptist',
 'Shorney, Mr. Charles Joseph',
 'Sirayanian, Mr. Orsen',
 'Skoog, Master. Harald',
 'Slocovski, Mr. Selman Francis',
 'Sloper, Mr. William Thompson',
 'Sobey, Mr. Samuel James Hayden',
 'Spencer, Mrs. William Augustus (Marie Eugenie)',
 'Staneff, Mr. Ivan',
 'Stewart, Mr. Albert A',
 'Todoroff, Mr. Lalio',
 'Turpin, Mr. William John Robert',
 'Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)',
 'Uruchurtu, Don. Manuel E',
 'Vander Planke, Miss. Augusta Maria',
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
 'Vestrom, Miss. Hulda Amanda Adolfina',
 'Waelens, Mr. Achille',
 'Webber, Miss. Susan',
 'Weisz, Mrs. Leopold (Mathilde Francoise Pede)',
 'West, Miss. Constance Mirium',
 'Wheadon, Mr. Edward H',
 'White, Mr. Percival Wayland',
 'White, Mr. Richard Frasar',
 'Williams, Mr. Charles Duane',
 'Williams, Mr. Charles Eugene',
 'Woolner, Mr. Hugh',
 'Zabour, Miss. Hileni',
 'van Billiard, Mr. Austin Blyler']

In [48]:
(sorted(titanic_train['Name']))[0:80:5] # we can indexing series because it is euivalent to list

['Ahlin, Mrs. Johan (Johanna Persdotter Larsson)',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Attalah, Miss. Malake',
 'Beesley, Mr. Lawrence',
 'Burke, Mr. Jeremiah',
 'Celotti, Mr. Francesco',
 'Connors, Mr. Patrick',
 'Devaney, Miss. Margaret Delia',
 'Emir, Mr. Farred Chehab',
 'Fortune, Mr. Charles Alexander',
 'Glynn, Miss. Mary Agatha',
 'Gustafsson, Mr. Anders Vilhelm',
 'Hewlett, Mrs. (Mary D Kingcome) ',
 'Ilett, Miss. Bertha',
 'Kantor, Mr. Sinai',
 'Madsen, Mr. Fridtjof Arne']

In [50]:
(sorted(titanic_train['Name']))[80:0:-3] # we can indexing series because it is euivalent to list

['McGowan, Miss. Anna "Annie"',
 'Masselmani, Mrs. Fatima',
 'Lennon, Mr. Denis',
 'Kink, Mr. Vincenz',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Ilett, Miss. Bertha',
 'Holverson, Mr. Alexander Oskar',
 'Heikkinen, Miss. Laina',
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
 'Goodwin, Miss. Lillian Amy',
 'Glynn, Miss. Mary Agatha',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Fortune, Miss. Mabel Helen',
 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)',
 'Drazenoic, Mr. Jozef',
 'Devaney, Miss. Margaret Delia',
 'Crease, Mr. Ernest James',
 'Coelho, Mr. Domingos Fernandeo',
 'Chaffee, Mr. Herbert Fuller',
 'Cann, Mr. Ernest Charles',
 'Burke, Mr. Jeremiah',
 'Bonnell, Miss. Elizabeth',
 'Baxter, Mr. Quigg Edmond',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andersson, Miss. Ellis Anna Maria']

In [52]:
sorted(titanic_train["Name"])[::-1] # Print in reverse order

['van Billiard, Mr. Austin Blyler',
 'Zabour, Miss. Hileni',
 'Woolner, Mr. Hugh',
 'Williams, Mr. Charles Eugene',
 'Williams, Mr. Charles Duane',
 'White, Mr. Richard Frasar',
 'White, Mr. Percival Wayland',
 'Wheadon, Mr. Edward H',
 'West, Miss. Constance Mirium',
 'Weisz, Mrs. Leopold (Mathilde Francoise Pede)',
 'Webber, Miss. Susan',
 'Waelens, Mr. Achille',
 'Vestrom, Miss. Hulda Amanda Adolfina',
 'Vander Planke, Mrs. Julius (Emelia Maria Vandemoortele)',
 'Vander Planke, Miss. Augusta Maria',
 'Uruchurtu, Don. Manuel E',
 'Turpin, Mrs. William John Robert (Dorothy Ann Wonnacott)',
 'Turpin, Mr. William John Robert',
 'Todoroff, Mr. Lalio',
 'Stewart, Mr. Albert A',
 'Staneff, Mr. Ivan',
 'Spencer, Mrs. William Augustus (Marie Eugenie)',
 'Sobey, Mr. Samuel James Hayden',
 'Sloper, Mr. William Thompson',
 'Slocovski, Mr. Selman Francis',
 'Skoog, Master. Harald',
 'Sirayanian, Mr. Orsen',
 'Shorney, Mr. Charles Joseph',
 'Sheerlinck, Mr. Jan Baptist',
 'Saundercock, Mr. William Henry',
 'Sandstrom, Miss. Marguerite Rut',
 'Samaan, Mr. Youssef',
 'Salkjelsvik, Miss. Anna Kristine',
 'Rugg, Miss. Emily',
 'Rogers, Mr. William John',
 'Robins, Mrs. Alexander A (Grace Charity Laury)',
 'Richard, Mr. Emile',
 'Rice, Master. Eugene',
 'Rekic, Mr. Tido',
 'Porter, Mr. Walter Chamberlain',
 'Petroff, Mr. Pastcho ("Pentcho")',
 'Petranec, Miss. Matilda',
 'Peter, Miss. Anna',
 'Pekoniemi, Mr. Edvard',
 'Pears, Mrs. Thomas (Edith Wearne)',
 'Panula, Master. Juha Niilo',
 'Palsson, Miss. Torborg Danira',
 'Palsson, Master. Gosta Leonard',
 'Ostby, Mr. Engelhart Cornelius',
 'Osen, Mr. Olaf Elon',
 'Olsen, Mr. Ole Martin',
 'O\'Dwyer, Miss. Ellen "Nellie"',
 "O'Driscoll, Miss. Bridget",
 'Nysten, Miss. Anna Sofia',
 'Nye, Mrs. (Elizabeth Ramell)',
 'Novel, Mr. Mansouer',
 'Nosworthy, Mr. Richard Cater',
 'Nicola-Yarred, Miss. Jamila',
 'Nicola-Yarred, Master. Elias',
 'Nicholls, Mr. Joseph Charles',
 'Newsom, Miss. Helen Monypeny',
 'Navratil, Mr. Michel ("Louis M Hoffman")',
 'Nasser, Mrs. Nicholas (Adele Achem)',
 'Nasser, Mr. Nicholas',
 'Moutal, Mr. Rahamin Haim',
 'Moubarek, Master. Gerios',
 'Moss, Mr. Albert Johan',
 'Moran, Mr. James',
 'Moran, Miss. Bertha',
 'Moore, Mr. Leonard Charles',
 'Moen, Mr. Sigurd Hansen',
 'Mionoff, Mr. Stoytcho',
 'Meyer, Mr. Edgar Joseph',
 'Meo, Mr. Alfonzo',
 'McMahon, Mr. Martin',
 'McGowan, Miss. Anna "Annie"',
 'McDermott, Miss. Brigdet Delia',
 'McCarthy, Mr. Timothy J',
 'Masselmani, Mrs. Fatima',
 'Mamee, Mr. Hanna',
 'Madsen, Mr. Fridtjof Arne',
 'Lennon, Mr. Denis',
 'Laroche, Miss. Simonne Marie Anne Andree',
 'Kraeff, Mr. Theodor',
 'Kink, Mr. Vincenz',
 'Kantor, Mr. Sinai',
 'Jussila, Miss. Katriina',
 'Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)',
 'Johansson, Mr. Gustaf Joel',
 'Jenkin, Mr. Stephen Curnow',
 'Ilett, Miss. Bertha',
 'Icard, Miss. Amelie',
 'Hood, Mr. Ambrose Jr',
 'Holverson, Mr. Alexander Oskar',
 'Hickman, Mr. Stanley George',
 'Hewlett, Mrs. (Mary D Kingcome) ',
 'Heikkinen, Miss. Laina',
 'Harris, Mr. Henry Birkhardt',
 'Harper, Mrs. Henry Sleeper (Myna Haxtun)',
 'Hakkarainen, Mrs. Pekka Pietari (Elin Matilda Dolck)',
 'Gustafsson, Mr. Anders Vilhelm',
 'Greenfield, Mr. William Bertram',
 'Goodwin, Miss. Lillian Amy',
 'Goodwin, Master. William Frederick',
 'Goldschmidt, Mr. George B',
 'Glynn, Miss. Mary Agatha',
 'Giglio, Mr. Victor',
 'Fynney, Mr. Joseph J',
 'Futrelle, Mrs. Jacques Heath (Lily May Peel)',
 'Futrelle, Mr. Jacques Heath',
 'Fortune, Mr. Charles Alexander',
 'Fortune, Miss. Mabel Helen',
 'Ford, Mr. William Neal',
 'Ford, Miss. Robina Maggie "Ruby"',
 'Faunthorpe, Mrs. Lizzie (Elizabeth Anne Wilkinson)',
 'Emir, Mr. Farred Chehab',
 'Ekstrom, Mr. Johan',
 'Drazenoic, Mr. Jozef',
 'Dowdell, Miss. Elizabeth',
 'Doling, Mrs. John T (Ada Julia Bone)',
 'Devaney, Miss. Margaret Delia',
 'Dean, Mr. Bertram Frank',
 'Cumings, Mrs. John Bradley (Florence Briggs Thayer)',
 'Crease, Mr. Ernest James',
 'Coxon, Mr. Daniel',
 'Connors, Mr. Patrick',
 'Coelho, Mr. Domingos Fernandeo',
 'Chronopoulos, Mr. Apostolos',
 'Christmann, Mr. Emil',
 'Chaffee, Mr. Herbert Fuller',
 'Celotti, Mr. Francesco',
 'Carrau, Mr. Francisco M',
 'Cann, Mr. Ernest Charles',
 'Caldwell, Master. Alden Gates',
 'Byles, Rev. Thomas Roussel Davids',
 'Burke, Mr. Jeremiah',
 'Braund, Mr. Owen Harris',
 'Boulos, Mrs. Joseph (Sultana)',
 'Bonnell, Miss. Elizabeth',
 'Bing, Mr. Lee',
 'Beesley, Mr. Lawrence',
 'Baxter, Mr. Quigg Edmond',
 'Bateman, Rev. Robert James',
 'Barton, Mr. David John',
 'Backstrom, Mrs. Karl Alfred (Maria Mathilda Gustafsson)',
 'Attalah, Miss. Malake',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)',
 'Arnold-Franchi, Mrs. Josef (Josefine Franchi)',
 'Andrew, Mr. Edgardo Samuel',
 'Andreasson, Mr. Paul Edvin',
 'Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andersson, Mr. Anders Johan',
 'Andersson, Miss. Erna Alexandra',
 'Andersson, Miss. Ellis Anna Maria',
 'Allen, Mr. William Henry',
 'Ahlin, Mrs. Johan (Johanna Persdotter Larsson)']

In [57]:
type(titanic_train[['Name']][4:7]) # Dataframe
titanic_train[["Name"]][4:7]

                       Name
4  Allen, Mr. William Henry
5          Moran, Mr. James
6   McCarthy, Mr. Timothy J

In [58]:
titanic_train.columns # getting columns in the data set

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [59]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [62]:
# Creating new column
titanic_train['new'] = "new_col"

In [65]:
# we can over write the existing column with given data it will change entire column
titanic_train['Ticket'] = "new_data"

In [64]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,new_data,7.2500,NaN,S,new_col
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,new_data,71.2833,C85,C,new_col
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,new_data,7.9250,NaN,S,new_col
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,new_data,53.1000,C123,S,new_col
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,new_data,8.0500,NaN,S,new_col

In [166]:
sorted(titanic_train["Name"])[5:10:2]# Check the first 15 sorted names

['Andersson, Mr. August Edvard ("Wennerstrom")',
 'Andrew, Mr. Edgardo Samuel',
 'Asplund, Mrs. Carl Oscar (Selma Augusta Emilia Johansson)']

In [167]:
titanic_train["Name"].describe()

count                              156
unique                             156
top       Williams, Mr. Charles Eugene
freq                                 1
Name: Name, dtype: object

In [168]:
titanic_train[["Ticket"]][4:9]

   Ticket
4  373450
5  330877
6   17463
7  349909
8  347742

In [169]:
titanic_train["Ticket"].describe()
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [171]:
titanic_train["sudh"]="sdffs"
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,sudh
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S,0,sdffs
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C,0,sdffs
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,0,sdffs
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S,0,sdffs
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S,0,sdffs

In [172]:
titanic_train["Cabin"][0:15]       # Check the first 15 tickets

0      NaN
1      C85
2      NaN
3     C123
4      NaN
5      NaN
6      E46
7      NaN
8      NaN
9      NaN
10      G6
11    C103
12     NaN
13     NaN
14     NaN
Name: Cabin, dtype: object

In [118]:
titanic_train.dtypes# Check number of unique cabins

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
test             int64
dtype: object

In [18]:
titanic_train["Survived"]

0      0
1      1
2      1
3      1
4      0
5      0
6      0
7      0
8      1
9      1
10     1
11     1
12     0
13     0
14     0
15     1
16     0
17     1
18     0
19     1
20     0
21     1
22     1
23     1
24     0
25     1
26     0
27     0
28     1
29     0
      ..
126    0
127    1
128    1
129    0
130    0
131    0
132    0
133    1
134    0
135    0
136    1
137    0
138    0
139    0
140    0
141    1
142    1
143    0
144    0
145    0
146    1
147    0
148    0
149    0
150    0
151    1
152    0
153    0
154    0
155    0
Name: Survived, Length: 156, dtype: int64

In [119]:
titanic_train.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked', 'test'],
      dtype='object')

In [66]:
titanic_train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,156.000000,156.000000,156.000000,126.000000,156.000000,156.000000,156.000000
mean,78.500000,0.346154,2.423077,28.141508,0.615385,0.397436,28.109587
std,45.177428,0.477275,0.795459,14.613880,1.056235,0.870146,39.401047
min,1.000000,0.000000,1.000000,0.830000,0.000000,0.000000,6.750000
25%,39.750000,0.000000,2.000000,19.000000,0.000000,0.000000,8.003150
50%,78.500000,0.000000,3.000000,26.000000,0.000000,0.000000,14.454200
75%,117.250000,1.000000,3.000000,35.000000,1.000000,0.000000,30.371850
max,156.000000,1.000000,3.000000,71.000000,5.000000,5.000000,263.000000

In [67]:
titanic_train['Pclass'] # its a series

0      3
1      1
2      3
3      1
4      3
      ..
151    1
152    3
153    3
154    3
155    1
Name: Pclass, Length: 156, dtype: int64

In [68]:
pd.Categorical(titanic_train['Pclass']) # return the distinct values in the Pclass column

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [75]:
# Renaming the Categories 
a = pd.Categorical(titanic_train['Pclass'])
a.rename_categories(['x1','x2','x3'])

[x3, x1, x3, x1, x3, ..., x1, x3, x3, x3, x1]
Length: 156
Categories (3, object): [x1, x2, x3]

In [78]:
# Renaming the Categories 
a = pd.Categorical(titanic_train['Pclass'])
b = a.rename_categories([55,66,77])
b

[77, 55, 77, 55, 77, ..., 55, 77, 77, 77, 55]
Length: 156
Categories (3, int64): [55, 66, 77]

In [79]:
titanic_train['newcol'] = b # create new column and assigning the new categories to new column

In [80]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,new_data,7.2500,NaN,S,new_col,77
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,new_data,71.2833,C85,C,new_col,55
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,new_data,7.9250,NaN,S,new_col,77
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,new_data,53.1000,C123,S,new_col,55
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,new_data,8.0500,NaN,S,new_col,77

In [82]:
b.describe() # describe() on categories

            counts     freqs
categories
55              30  0.192308
66              30  0.192308
77              96  0.615385

In [83]:
titanic_train['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [84]:
titanic_train['Cabin'].dtypes

dtype('O')

In [85]:
titanic_train['Cabin'].astype(str) # convert data to str

0       nan
1       C85
2       nan
3      C123
4       nan
       ...
151      C2
152     nan
153     nan
154     nan
155     nan
Name: Cabin, Length: 156, dtype: object

In [89]:
char_cabin = titanic_train['Cabin'].astype(str)
# Coverting list into numpy array
new_Cabin = np.array([cabin[0] for cabin in char_cabin]) #Take first letter
new_Cabin = pd.Categorical(new_Cabin)
new_Cabin.describe()
new_Cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [90]:
# Replace Cabin columns values with new_Cabin values
titanic_train['Cabin'] = new_Cabin

In [91]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,new_data,7.2500,n,S,new_col,77
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,new_data,71.2833,C,C,new_col,55
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,new_data,7.9250,n,S,new_col,77
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,new_data,53.1000,C,S,new_col,55
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,new_data,8.0500,n,S,new_col,77

In [96]:
# Checking null values with isnull()
# list will not show index and series will show indexes
dummy_vector = pd.Series([1,None,3,None,7,8]) 
dummy_vector.isnull()

0    False
1     True
2    False
3     True
4    False
5    False
dtype: bool

In [98]:
titanic_train["Age"]

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
151    22.0
152    55.5
153    40.5
154     NaN
155    51.0
Name: Age, Length: 156, dtype: float64

In [99]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
       ...
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [100]:
# gETTING iNDEXES only If Age is null
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154], dtype=int64),)

In [103]:
#lenghth of missing values for Age column
len(missing[0])

30

In [104]:
# Getting all the record values if Age value is null
titanic_train.loc[missing]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,new_data,8.4583,n,Q,new_col,77
17,18,1,2,"Williams, Mr. Charles Eugene",male,NaN,0,0,new_data,13.0000,n,S,new_col,66
19,20,1,3,"Masselmani, Mrs. Fatima",female,NaN,0,0,new_data,7.2250,n,C,new_col,77
26,27,0,3,"Emir, Mr. Farred Chehab",male,NaN,0,0,new_data,7.2250,n,C,new_col,77
28,29,1,3,"O'Dwyer, Miss. Ellen ""Nellie""",female,NaN,0,0,new_data,7.8792,n,Q,new_col,77
29,30,0,3,"Todoroff, Mr. Lalio",male,NaN,0,0,new_data,7.8958,n,S,new_col,77
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,new_data,146.5208,B,C,new_col,55
32,33,1,3,"Glynn, Miss. Mary Agatha",female,NaN,0,0,new_data,7.7500,n,Q,new_col,77
36,37,1,3,"Mamee, Mr. Hanna",male,NaN,0,0,new_data,7.2292,n,C,new_col,77
42,43,0,3,"Kraeff, Mr. Theodor",male,NaN,0,0,new_data,7.8958,n,C,new_col,77
45,46,0,3,"Rogers, Mr. William John",male,NaN,0,0,new_data,8.0500,n,S,new_col,77
46,47,0,3,"Lennon, Mr. Denis",male,NaN,1,0,new_data,15.5000,n,Q,new_col,77
47,48,1,3,"O'Driscoll, Miss. Bridget",female,NaN,0,0,new_data,7.7500,n,Q,new_col,77
48,49,0,3,"Samaan, Mr. Youssef",male,NaN,2,0,new_data,21.6792,n,C,new_col,77
55,56,1,1,"Woolner, Mr. Hugh",male,NaN,0,0,new_data,35.5000,C,S,new_col,55
64,65,0,1,"Stewart, Mr. Albert A",male,NaN,0,0,new_data,27.7208,n,C,new_col,55
65,66,1,3,"Moubarek, Master. Gerios",male,NaN,1,1,new_data,15.2458,n,C,new_col,77
76,77,0,3,"Staneff, Mr. Ivan",male,NaN,0,0,new_data,7.8958,n,S,new_col,77
77,78,0,3,"Moutal, Mr. Rahamin Haim",male,NaN,0,0,new_data,8.0500,n,S,new_col,77
82,83,1,3,"McDermott, Miss. Brigdet Delia",female,NaN,0,0,new_data,7.7875,n,Q,new_col,77
87,88,0,3,"Slocovski, Mr. Selman Francis",male,NaN,0,0,new_data,8.0500,n,S,new_col,77
95,96,0,3,"Shorney, Mr. Charles Joseph",male,NaN,0,0,new_data,8.0500,n,S,new_col,77
101,102,0,3,"Petroff, Mr. Pastcho (""Pentcho"")",male,NaN,0,0,new_data,7.8958,n,S,new_col,77
107,108,1,3,"Moss, Mr. Albert Johan",male,NaN,0,0,new_data,7.7750,n,S,new_col,77
109,110,1,3,"Moran, Miss. Bertha",female,NaN,1,0,new_data,24.1500,n,Q,new_col,77
121,122,0,3,"Moore, Mr. Leonard Charles",male,NaN,0,0,new_data,8.0500,n,S,new_col,77
126,127,0,3,"McMahon, Mr. Martin",male,NaN,0,0,new_data,7.7500,n,Q,new_col,77
128,129,1,3,"Peter, Miss. Anna",female,NaN,1,1,new_data,22.3583,F,C,new_col,77
140,141,0,3,"Boulos, Mrs. Joseph (Sultana)",female,NaN,0,2,new_data,15.2458,n,C,new_col,77
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,new_data,7.3125,n,S,new_col,77

In [105]:
titanic_train

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,new_data,7.2500,n,S,new_col,77
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,new_data,71.2833,C,C,new_col,55
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,new_data,7.9250,n,S,new_col,77
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,new_data,53.1000,C,S,new_col,55
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,new_data,8.0500,n,S,new_col,77
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
151,152,1,1,"Pears, Mrs. Thomas (Edith Wearne)",female,22.0,1,0,new_data,66.6000,C,S,new_col,55
152,153,0,3,"Meo, Mr. Alfonzo",male,55.5,0,0,new_data,8.0500,n,S,new_col,77
153,154,0,3,"van Billiard, Mr. Austin Blyler",male,40.5,0,2,new_data,14.5000,n,S,new_col,77
154,155,0,3,"Olsen, Mr. Ole Martin",male,NaN,0,0,new_data,7.3125,n,S,new_col,77
155,156,0,1,"Williams, Mr. Charles Duane",male,51.0,0,1,new_data,61.3792,n,C,new_col,55

In [106]:
# Get person who paid 53.100 pound
titanic_train['Fare']

0       7.2500
1      71.2833
2       7.9250
3      53.1000
4       8.0500
        ...
151    66.6000
152     8.0500
153    14.5000
154     7.3125
155    61.3792
Name: Fare, Length: 156, dtype: float64

In [107]:
max(titanic_train['Fare'])

263.0

In [108]:
index = np.where(titanic_train['Fare'] == max(titanic_train['Fare']))
titanic_train.loc[index]['Name']

27    Fortune, Mr. Charles Alexander
88        Fortune, Miss. Mabel Helen
Name: Name, dtype: object

In [117]:
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol,Family
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,new_data,7.2500,n,S,new_col,77,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,new_data,71.2833,C,C,new_col,55,1
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,new_data,7.9250,n,S,new_col,77,0
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,new_data,53.1000,C,S,new_col,55,1
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,new_data,8.0500,n,S,new_col,77,0

In [120]:
# Merging two numerical columns into new column and get the max (maximum number of family) column
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
titanic_train.loc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,new,newcol,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,new_data,46.9,n,S,new_col,77,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,new_data,46.9,n,S,new_col,77,7

In [122]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

In [124]:
# Coverting List into Series.Series it will show indexes default indexes are 0,1,2,...n
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [126]:
# Giving customer indexes i.e labels=["a","b","c"]
pd.Series(my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [128]:
# Converting Array into Series
print("\nHolding numerical data\n",'-'*25,sep='')
print(pd.Series(arr))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [130]:
# Converting Array into Series
print("\nHolding numerical data\n",'-'*25,sep='')
print(pd.Series(arr))

Holding numerical data
-------------------------
0    10
1    20
2    30
dtype: int32

In [131]:
# Converting List into Series
print("\nHolding label data\n",'-'*25,sep='')
print(pd.Series(labels))

Holding label data
-------------------------
0    a
1    b
2    c
dtype: object

In [133]:
print("\nHolding functions\n",'-'*25,sep='')
print(pd.Series(data=[sum,print,len]))

Holding functions
-------------------------
0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [134]:
print("\nHolding objects from Dictionary\n",'-'*25,sep='')
print(pd.Series(data=[d.keys,d.items,d.values]))

Holding objects from Dictionary
-------------------------
0    <built-in method keys of dict object at 0x0000...
1    <built-in method items of dict object at 0x000...
2    <built-in method values of dict object at 0x00...
dtype: object

In [142]:
ser1 = pd.Series([1,2,3,4],['CA','OR','CO','AZ']) # Access the data using default index and custom index(Overwrite index)
ser1['CA']

1

In [135]:
ser1 = pd.Series([1,2,3,4],['CA','OR','CO','AZ'])
ser2 = pd.Series([1,2,5,4],['CA','OR','NV','AZ'])

In [137]:
print("\nIndexing by name of the item/object (string indetifier)\n",'-'*56,sep='')
print("Value for CA in ser1:",ser1['CA'])
print("Value for AZ in ser1:",ser1['AZ'])
print("Value for NV in ser2:",ser2['NV'])

Indexing by name of the item/object (string indetifier)
--------------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [143]:
print("\nIndexing by name of the item/object (string indetifier)\n",'-'*56,sep='')
print("Value for CA in ser1:",ser1[0])
print("Value for AZ in ser1:",ser1[3])
print("Value for NV in ser2:",ser2[2])

Indexing by name of the item/object (string indetifier)
--------------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

In [144]:
print("\nIndexing by a range\n",'-'*25,sep='')
print("value for OR,CO, and AZ in ser1:\n",ser1[1:],sep='')

Indexing by a range
-------------------------
value for OR,CO, and AZ in ser1:
OR    2
CO    3
AZ    4
dtype: int64

In [146]:
ser1 = pd.Series([1,2,3,4],['CA','OR','CO','AZ'])
ser2 = pd.Series([1,2,5,4],['CA','OR','NV','AZ'])
ser3 = ser1+ser2 # sum of same index values in ser1 and ser2 other index value will be Nan
print(ser3)

AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

In [147]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    8.0
CA    2.0
CO    NaN
NV    NaN
OR    4.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [148]:
ser1 = pd.Series([1,2,3,4,5],['CA','OR','CO','AZ','CA'])
ser2 = pd.Series([1,2,5,4,4],['CA','OR','NV','AZ','OR'])
ser3 = ser1+ser2 # sum of same index values in ser1 and ser2 other index value will be Nan
print(ser3)

AZ    8.0
CA    2.0
CA    6.0
CO    NaN
NV    NaN
OR    4.0
OR    6.0
dtype: float64

In [149]:
print("\nOr even for combination of mathematical operations!\n",'-'*53,sep='')
print(np.exp(ser1)+np.log10(ser2))

Or even for combination of mathematical operations!
-----------------------------------------------------
AZ     55.200210
CA      2.718282
CA    148.413159
CO           NaN
NV           NaN
OR      7.690086
OR      7.991116
dtype: float64

In [158]:
from numpy.random import randn as rn
np.random.seed(100)
matrix_data = rn(5,4)
matrix_data

array([[-1.74976547,  0.3426804 ,  1.1530358 , -0.25243604],
       [ 0.98132079,  0.51421884,  0.22117967, -1.07004333],
       [-0.18949583,  0.25500144, -0.45802699,  0.43516349],
       [-0.58359505,  0.81684707,  0.67272081, -0.10441114],
       [-0.53128038,  1.02973269, -0.43813562, -1.11831825]])

In [231]:
from numpy.random import randn as rn
np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,columns=column_headings) # Convert array to data frame
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [178]:
print("\nThe 'X column'",'-'*25,sep='')
print(df['X'])

The 'X column'-------------------------
A    0.628133
B   -0.319318
C    0.740122
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [179]:
print("\nType of the column : ",type(df['X']),sep='')
print("\nThe 'X' and 'Y' column indexed by passed a list:\n",'-'*25,sep='')
print(df[['X','Y']])

Type of the column : <class 'pandas.core.series.Series'>

The 'X' and 'Y' column indexed by passed a list:
-------------------------
          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [180]:
df['Z']

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [181]:
df.Z

A    0.503826
B    0.605965
C   -0.589001
D    0.955057
E    0.683509
Name: Z, dtype: float64

In [182]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [183]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [184]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [185]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [186]:
# In series default and custom index work fine. but in DataFrame only Custom or default index work
df.loc['A'] # df.loc[['A','B']]

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
New    1.131958
Name: A, dtype: float64

In [187]:
# if you have custom indexes but we can extract data using iloc using default indexes 
df.iloc[0]  # integer location

W      2.706850
X      0.628133
Y      0.907969
Z      0.503826
New    1.131958
Name: A, dtype: float64

In [188]:
# using loc() we can extract label index data
# using iloc() we can extract data using default index

In [189]:
df.loc[["A","B"]]

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647

In [190]:
df.iloc[[0,4]]

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.131958
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [192]:
df

          W         X         Y         Z       New
A  2.706850  0.628133  0.907969  0.503826  1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266

In [200]:
# getting intersection of data
df.loc[['C','D'],["X","Y"]]

          X         Y
C  0.740122  0.528813
D -0.758872 -0.933237

In [207]:
df.loc[:, ['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
C  0.740122  0.528813
D -0.758872 -0.933237
E  1.978757  2.605967

In [214]:
df.iloc[[0,1],[0,1]] # iloc() accepts only numerical indexes (default indexes)

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318

In [215]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [218]:
# Droping the New column i.e temporarily
df.drop('New',axis=1) # axis = 0 for row and axis = 1 for column

          W         X         Y         Z  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826              1.131958
B  0.651118 -0.319318 -0.848077  0.605965              0.286647
C -2.018168  0.740122  0.528813 -0.589001              0.151122
D  0.188695 -0.758872 -0.933237  0.955057              0.196184
E  0.190794  1.978757  2.605967  0.683509              2.662266

In [220]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826  1.131958              1.131958
B  0.651118 -0.319318 -0.848077  0.605965  0.286647              0.286647
C -2.018168  0.740122  0.528813 -0.589001  0.151122              0.151122
D  0.188695 -0.758872 -0.933237  0.955057  0.196184              0.196184
E  0.190794  1.978757  2.605967  0.683509  2.662266              2.662266

In [222]:
# Drop the columns or row permanently  or we can reassign i.e df = df.drop('New',axis=1)
df.drop('New',axis=1,inplace=True)

In [224]:
df

          W         X         Y         Z  New (Sum of X and Z)
A  2.706850  0.628133  0.907969  0.503826              1.131958
B  0.651118 -0.319318 -0.848077  0.605965              0.286647
C -2.018168  0.740122  0.528813 -0.589001              0.151122
D  0.188695 -0.758872 -0.933237  0.955057              0.196184
E  0.190794  1.978757  2.605967  0.683509              2.662266

In [229]:
# axis = 0 means row by default axis value is o
df.drop(['C','D'],axis=0,inplace=True)

In [230]:
df

          W         X         Y         Z  New (Sum of X and Z)
B  0.651118 -0.319318 -0.848077  0.605965              0.286647
E  0.190794  1.978757  2.605967  0.683509              2.662266

In [232]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [236]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W    0.188695
X   -0.758872
Y   -0.933237
Z    0.955057
Name: D, dtype: float64

In [235]:
# df.ix() will accept both label and default indexes

In [237]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [238]:
# Getting the particular value in df
df.loc['C','Z']

-0.5890005332865824

In [243]:
# Getting all column values for both A and B rows
df.loc[['A','B'],]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965

In [246]:
# iloc() support slicing and indexing and Jumping
df.iloc[:3,:3]

          W         X         Y
A  2.706850  0.628133  0.907969
B  0.651118 -0.319318 -0.848077
C -2.018168  0.740122  0.528813

In [247]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [248]:
# Return True if value is >0 
df>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [250]:
# Return or replace values Nan in the place of False or negative number
df[df>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [251]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [252]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False
D   True  False  False   True
E   True   True   True   True

In [256]:
df.loc[['A','B','C']]>0

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [257]:
df[df.loc[['A','B','C']]>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D       NaN       NaN       NaN       NaN
E       NaN       NaN       NaN       NaN

In [253]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A   True   True   True   True
B   True  False  False   True
C  False   True   True  False

In [254]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [258]:
import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [263]:
type(matrix_data)

numpy.matrix

In [264]:
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [265]:
df = pd.DataFrame(data=matrix_data,index=row_labels,columns=column_headings)
print("\n A new DataFrame\n",'-'*25,sep='')
print(df)

 A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [267]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [268]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [269]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

In [270]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [271]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [272]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [273]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

In [274]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [275]:
df

   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [279]:
# drop = True it will drop previous indexes but not permanently
df.reset_index(drop=True)

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [286]:
# If we want to delete previous indexes we need to use drop= True,inplace=True
df.reset_index(drop=True,inplace=True)

In [287]:
df

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [277]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [288]:
df

   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

In [289]:
b = "Student Teacher Engineer Doctor Nurse".split()
b

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [290]:
df['new'] = b

In [291]:
df

   Age  Height  Weight       new
0   22      66     140   Student
1   42      70     148   Teacher
2   30      62     125  Engineer
3   35      68     160    Doctor
4   25      62     152     Nurse

In [294]:
# setting up a new index. to permanently change the changes use inplace =True
df.set_index('new')

          Age  Height  Weight
new
Student    22      66     140
Teacher    42      70     148
Engineer   30      62     125
Doctor     35      68     160
Nurse      25      62     152

In [295]:
df

   Age  Height  Weight       new
0   22      66     140   Student
1   42      70     148   Teacher
2   30      62     125  Engineer
3   35      68     160    Doctor
4   25      62     152     Nurse

In [296]:
# setting up a new index. to permanently change the changes use inplace =True
df.set_index('new',inplace=True)

In [297]:
df

          Age  Height  Weight
new
Student    22      66     140
Teacher    42      70     148
Engineer   30      62     125
Doctor     35      68     160
Nurse      25      62     152

In [298]:
df.loc['Student']

Age        22
Height     66
Weight    140
Name: Student, dtype: int32

In [301]:
# print("\nAfter resetting index\n",'-'*35, sep='')
# print(df.reset_index())

# print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
# print(df.reset_index(drop=True))
# "Student Teacher Engineer Doctor Nurse".split()

# print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
# df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
# print(df)

# print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
# print (df.set_index('Profession'))

In [302]:
a = [1,2,3]
b = ["a","b","c"]
list(zip(a,b))

[(1, 'a'), (2, 'b'), (3, 'c')]

In [303]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [304]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [306]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [307]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [310]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)
df1

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1  3.0  1.0  1.0
   2  1.0  1.0 -0.0
   3 -1.0  1.0 -2.0
G2 1  1.0  1.0 -1.0
   2  0.0 -1.0 -1.0
   3  1.0  0.0  2.0

        A    B    C
G1 1  3.0  1.0  1.0
   2  1.0  1.0 -0.0
   3 -1.0  1.0 -2.0
G2 1  1.0  1.0 -1.0
   2  0.0 -1.0 -1.0
   3  1.0  0.0  2.0

In [311]:
df1.loc['G1']

     A    B    C
1  3.0  1.0  1.0
2  1.0  1.0 -0.0
3 -1.0  1.0 -2.0

In [312]:
df1.loc['G1'].loc[1]

A    3.0
B    1.0
C    1.0
Name: 1, dtype: float64

In [313]:
#cross tabulation like pivot table
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1  3.0  1.0  1.0
2  1.0  1.0 -0.0
3 -1.0  1.0 -2.0

In [71]:
a = titanic_train['Pclass'].unique()
a

array([3, 1, 2], dtype=int64)

In [72]:
titanic_train['Cabin'].unique()

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [193]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])

new_Pclass

[90, dfsf, 90, dfsf, 90, ..., dfsf, 90, 90, 90, dfsf]
Length: 156
Categories (3, object): [dfsf, 9, 90]

In [179]:
new_Pclass = pd.Categorical(titanic_train["Pclass"])
new_Pclass

[3, 1, 3, 1, 3, ..., 1, 3, 3, 3, 1]
Length: 156
Categories (3, int64): [1, 2, 3]

In [181]:
titanic_train["Cabin"].unique()   # Check unique cabins

array([nan, 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2'], dtype=object)

In [184]:
import numpy as np 
char_cabin = titanic_train["Cabin"].astype(str) # Convert data to str

new_Cabin = [cabin[0] for cabin in char_cabin] # Take first letter

new_Cabin = pd.Categorical(new_Cabin)
#new_Cabin
new_Cabin

[n, C, n, C, n, ..., C, n, n, n, n]
Length: 156
Categories (8, object): [A, B, C, D, E, F, G, n]

In [186]:
titanic_train["Cabin"] = new_Cabin
titanic_train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,sudh,Cabin1
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,n,S,0,sdffs,n
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C,C,0,sdffs,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,n,S,0,sdffs,n
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C,S,0,sdffs,C
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,n,S,0,sdffs,n

In [188]:
titanic_train["Age"].isnull()

0      False
1      False
2      False
3      False
4      False
5       True
6      False
7      False
8      False
9      False
10     False
11     False
12     False
13     False
14     False
15     False
16     False
17      True
18     False
19      True
20     False
21     False
22     False
23     False
24     False
25     False
26      True
27     False
28      True
29      True
       ...
126     True
127    False
128     True
129    False
130    False
131    False
132    False
133    False
134    False
135    False
136    False
137    False
138    False
139    False
140     True
141    False
142    False
143    False
144    False
145    False
146    False
147    False
148    False
149    False
150    False
151    False
152    False
153    False
154     True
155    False
Name: Age, Length: 156, dtype: bool

In [189]:
missing = np.where(titanic_train["Age"].isnull() == True)
missing

(array([  5,  17,  19,  26,  28,  29,  31,  32,  36,  42,  45,  46,  47,
         48,  55,  64,  65,  76,  77,  82,  87,  95, 101, 107, 109, 121,
        126, 128, 140, 154]),)

In [132]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88]),)

In [191]:
titanic_train.iloc[np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,sudh,Cabin1
27,28,0,dfsf,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0,C,S,0,sdffs,C
88,89,1,dfsf,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0,C,S,0,sdffs,C

In [30]:
np.where(titanic_train["Fare"]==max(titanic_train["Fare"]))

(array([27, 88]),)

In [31]:
len(missing[0])

30

In [194]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]
titanic_train["Family"]
most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family

(array([59, 71]),)

In [135]:
titanic_train["Family"] = titanic_train["SibSp"] + titanic_train["Parch"]

most_family = np.where(titanic_train["Family"] == max(titanic_train["Family"]))
most_family
titanic_train.iloc[most_family]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,test,Cabin1,Family
59,60,0,3,"Goodwin, Master. William Frederick",male,11.0,5,2,CA 2144,46.9,NaN,S,0,n,7
71,72,0,3,"Goodwin, Miss. Lillian Amy",female,16.0,5,2,CA 2144,46.9,NaN,S,0,n,7

In [196]:
import numpy as np
import pandas as pd

labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10,'b':20,'c':30}

print ("Labels:", labels)
print("My data:", my_data)
print("Dictionary:", d)
pd.Series(my_data, index=labels)

Labels: ['a', 'b', 'c']
My data: [10, 20, 30]
Dictionary: {'a': 10, 'b': 20, 'c': 30}

a    10
b    20
c    30
dtype: int64

In [35]:
pd.Series(my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [199]:
print ("\nHolding numerical data\n",'-'*25, sep='')
print(pd.Series(arr)[1])

Holding numerical data
-------------------------
20

In [198]:
print ("\nHolding text labels\n",'-'*20, sep='')
print(pd.Series(labels))

Holding text labels
--------------------
0    a
1    b
2    c
dtype: object

In [201]:

d = {'a':"kjhk",'b':20,'c':30}
d.items
pd.DataFrame(d,index = ['a','b','c'])

      a   b   c
a  kjhk  20  30
b  kjhk  20  30
c  kjhk  20  30

In [203]:
print ("\nHolding objects from a dictionary\n",'-'*40, sep='')
print(pd.Series([type, sum, max]))

Holding objects from a dictionary
----------------------------------------
0             <class 'type'>
1    <built-in function sum>
2    <built-in function max>
dtype: object

In [216]:
ser1 = pd.Series([1,2,3,4],index = [2,4,6,8])
ser2 = pd.Series([1,2,5,4],['CA', 'OR', 'NV', 'AZ'])
ser1

2    1
4    2
6    3
8    4
dtype: int64

In [217]:
ser1[0:3:2]

2    1
6    3
dtype: int64

In [42]:
print ("\nIndexing by number (positional value in the series)\n",'-'*52, sep='')
print("Value for CA in ser1:", ser1[0])
print("Value for AZ in ser1:", ser1[3])
print("Value for NV in ser2:", ser2[2])
ser1

Indexing by number (positional value in the series)
----------------------------------------------------
Value for CA in ser1: 1
Value for AZ in ser1: 4
Value for NV in ser2: 5

CA    1
OR    2
CO    3
AZ    4
dtype: int64

In [215]:
print ("\nIndexing by a range\n",'-'*25, sep='')
print ("Value for OR, CO, and AZ in ser1:\n", ser1[0:3:2], sep='')

Indexing by a range
-------------------------
Value for OR, CO, and AZ in ser1:
100    1
CO     3
dtype: int64

In [44]:
ser1 = pd.Series([1,2,3,4],['CA', 'OR', 'CO', 'CA'])
ser2 = pd.Series([1,2,5,4],['CA', 'NV', 'AZ','OR'])
ser3 = ser1+ser2
ser3

AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

In [45]:
print ("\nAfter adding the two series, the result looks like this...\n",'-'*59, sep='')
print(ser3)
print("\nPython tries to add values where it finds common index name, and puts NaN where indices are missing\n")

After adding the two series, the result looks like this...
-----------------------------------------------------------
AZ    NaN
CA    2.0
CA    5.0
CO    NaN
NV    NaN
OR    6.0
dtype: float64

Python tries to add values where it finds common index name, and puts NaN where indices are missing

In [46]:
print ("\nThe idea works even for multiplication...\n",'-'*43, sep='')
print (ser1*ser2)

The idea works even for multiplication...
-------------------------------------------
AZ    NaN
CA    1.0
CA    4.0
CO    NaN
NV    NaN
OR    8.0
dtype: float64

In [47]:
from numpy.random import randn as rn
#np.random.seed(101)
matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']

df = pd.DataFrame(matrix_data,row_labels,column_headings)
#print("\nThe data frame looks like\n",'-'*45, sep='')
df

          W         X         Y         Z
A  0.150705 -0.446910  1.669238 -1.138071
B  0.462929  0.129871  0.128628  1.865870
C  0.783021  0.561695 -1.608215 -0.997146
D  1.124639  0.626070 -0.129314 -0.075665
E  0.133687  1.988570  0.416920 -0.729497

In [48]:
df.iloc[2]

W    0.783021
X    0.561695
Y   -1.608215
Z   -0.997146
Name: C, dtype: float64

In [49]:
print("\nType of the pair of columns: ", type(df[['X','Z']]), sep='')
print ("\nSo, for more than one column, the object turns into a DataFrame")

Type of the pair of columns: <class 'pandas.core.frame.DataFrame'>

So, for more than one column, the object turns into a DataFrame

In [50]:
print("\nThe 'X' column accessed by DOT method (NOT recommended)\n",'-'*55, sep='')
print(df["X"])

The 'X' column accessed by DOT method (NOT recommended)
-------------------------------------------------------
A   -0.446910
B    0.129871
C    0.561695
D    0.626070
E    1.988570
Name: X, dtype: float64

In [51]:
print("\nA column is created by assigning it in relation to an existing column\n",'-'*75, sep='')
df['New'] = df['X']+df['Z']
df['New (Sum of X and Z)'] = df['X']+df['Z']
print(df)

A column is created by assigning it in relation to an existing column
---------------------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
A  0.150705 -0.446910  1.669238 -1.138071 -1.584981             -1.584981
B  0.462929  0.129871  0.128628  1.865870  1.995741              1.995741
C  0.783021  0.561695 -1.608215 -0.997146 -0.435451             -0.435451
D  1.124639  0.626070 -0.129314 -0.075665  0.550405              0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073              1.259073

In [52]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  0.150705 -0.446910  1.669238 -1.138071 -1.584981             -1.584981
B  0.462929  0.129871  0.128628  1.865870  1.995741              1.995741
C  0.783021  0.561695 -1.608215 -0.997146 -0.435451             -0.435451
D  1.124639  0.626070 -0.129314 -0.075665  0.550405              0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073              1.259073

In [53]:
print("\nA column is dropped by using df.drop() method\n",'-'*55, sep=' ')
df.drop("C",inplace=True) # Notice the axis=1 option, axis = 0 is default, so one has to change it to 1

A column is dropped by using df.drop() method
 -------------------------------------------------------

In [54]:
df

          W         X         Y         Z       New  New (Sum of X and Z)
A  0.150705 -0.446910  1.669238 -1.138071 -1.584981             -1.584981
B  0.462929  0.129871  0.128628  1.865870  1.995741              1.995741
D  1.124639  0.626070 -0.129314 -0.075665  0.550405              0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073              1.259073

In [55]:
df1=df.drop('A')
print("\nA row (index) is dropped by using df.drop() method and axis=0\n",'-'*65, sep='')
print(df1)

A row (index) is dropped by using df.drop() method and axis=0
-----------------------------------------------------------------
          W         X         Y         Z       New  New (Sum of X and Z)
B  0.462929  0.129871  0.128628  1.865870  1.995741              1.995741
D  1.124639  0.626070 -0.129314 -0.075665  0.550405              0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073              1.259073

In [56]:
print("\nAn in-place change can be done by making inplace=True in the drop method\n",'-'*75, sep='')
df.drop('New (Sum of X and Z)', axis=1, inplace=True)
print(df)

An in-place change can be done by making inplace=True in the drop method
---------------------------------------------------------------------------
          W         X         Y         Z       New
A  0.150705 -0.446910  1.669238 -1.138071 -1.584981
B  0.462929  0.129871  0.128628  1.865870  1.995741
D  1.124639  0.626070 -0.129314 -0.075665  0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073

In [57]:
### Selecting/indexing Rows
#* Label-based 'loc' method
#* Index (numeric) 'iloc' method
df

          W         X         Y         Z       New
A  0.150705 -0.446910  1.669238 -1.138071 -1.584981
B  0.462929  0.129871  0.128628  1.865870  1.995741
D  1.124639  0.626070 -0.129314 -0.075665  0.550405
E  0.133687  1.988570  0.416920 -0.729497  1.259073

In [58]:
print("\nLabel-based 'loc' method can be used for selecting row(s)\n",'-'*60, sep='')
print("\nSingle row\n")
print(df.iloc[3])

Label-based 'loc' method can be used for selecting row(s)
------------------------------------------------------------

Single row

W      0.133687
X      1.988570
Y      0.416920
Z     -0.729497
New    1.259073
Name: E, dtype: float64

In [59]:
print("\nMultiple rows\n")
print(df.loc[['B','C']])

Multiple rows

          W         X         Y        Z       New
B  0.462929  0.129871  0.128628  1.86587  1.995741
C       NaN       NaN       NaN      NaN       NaN

/Users/sudhanshukumar/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:2: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate-loc-reindex-listlike

In [60]:
print("\nIndex position based 'iloc' method can be used for selecting row(s)\n",'-'*70, sep='')
print("\nSingle row\n")
print(df.iloc[2])

Index position based 'iloc' method can be used for selecting row(s)
----------------------------------------------------------------------

Single row

W      1.124639
X      0.626070
Y     -0.129314
Z     -0.075665
New    0.550405
Name: D, dtype: float64

In [61]:
print("\nMultiple rows\n")
print(df.iloc[[1,2]])

Multiple rows

          W         X         Y         Z       New
B  0.462929  0.129871  0.128628  1.865870  1.995741
D  1.124639  0.626070 -0.129314 -0.075665  0.550405

In [62]:
#### Subsetting DataFrame

In [63]:

matrix_data = rn(5,4)
row_labels = ['A','B','C','D','E']
column_headings = ['W','X','Y','Z']
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)

In [64]:
print("\nThe DatFrame\n",'-'*45, sep='')
print(df)

The DatFrame
---------------------------------------------
          W         X         Y         Z
A -0.320697  1.586737 -0.962361  0.984044
B -0.236481 -0.520044 -0.137304 -1.719868
C -0.415743 -0.280577  1.293790 -0.495861
D -0.564725 -1.331318 -1.098884  0.385147
E  1.079266  1.101438  1.097766  0.452282

In [65]:
print("\nElement at row 'B' and column 'Y' is\n") 
print(df.loc[['B','C'],['Y','W']])

Element at row 'B' and column 'Y' is

          Y         W
B -0.137304 -0.236481
C  1.293790 -0.415743

In [66]:
print("\nSubset comprising of rows B and D, and columns W and Y, is\n")
df.iloc[[1,2,3],[0,1]]

Subset comprising of rows B and D, and columns W and Y, is

          W         X
B -0.236481 -0.520044
C -0.415743 -0.280577
D -0.564725 -1.331318

In [67]:
print(df.loc[['B','C'],])

          W         X         Y         Z
B -0.236481 -0.520044 -0.137304 -1.719868
C -0.415743 -0.280577  1.293790 -0.495861

In [68]:
print("\nThe DataFrame\n",'-'*45, sep='')
print(df)

The DataFrame
---------------------------------------------
          W         X         Y         Z
A -0.320697  1.586737 -0.962361  0.984044
B -0.236481 -0.520044 -0.137304 -1.719868
C -0.415743 -0.280577  1.293790 -0.495861
D -0.564725 -1.331318 -1.098884  0.385147
E  1.079266  1.101438  1.097766  0.452282

In [69]:
print("\nBoolean DataFrame(s) where we are checking if the values are greater than 0\n",'-'*75, sep='')
print(df>0)

Boolean DataFrame(s) where we are checking if the values are greater than 0
---------------------------------------------------------------------------
       W      X      Y      Z
A  False   True  False   True
B  False  False  False  False
C  False  False   True  False
D  False  False  False   True
E   True   True   True   True

In [70]:
print("\n")
print(df.loc[['A','B','C']]>0)

       W      X      Y      Z
A  False   True  False   True
B  False  False  False  False
C  False  False   True  False

In [71]:
booldf = df>0
print("\nDataFrame indexed by boolean dataframe\n",'-'*45, sep='')
print(df[booldf])

DataFrame indexed by boolean dataframe
---------------------------------------------
          W         X         Y         Z
A       NaN  1.586737       NaN  0.984044
B       NaN       NaN       NaN       NaN
C       NaN       NaN  1.293790       NaN
D       NaN       NaN       NaN  0.385147
E  1.079266  1.101438  1.097766  0.452282

In [72]:

import pandas as pd 
import numpy as np
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']
matrix_data

matrix([[ 22,  66, 140],
        [ 42,  70, 148],
        [ 30,  62, 125],
        [ 35,  68, 160],
        [ 25,  62, 152]])

In [73]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nA new DataFrame\n",'-'*25, sep='')
print(df)

A new DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [74]:
df[df['Height']>65]

   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [75]:
print("\nRows with Height > 65 inch\n",'-'*35, sep='')
print(df[df['Height']>65])

Rows with Height > 65 inch
-----------------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
D   35      68     160

In [76]:
df['Height']>65

A     True
B     True
C    False
D     True
E    False
Name: Height, dtype: bool

In [77]:
booldf1 = df['Height']>65
booldf2 = df['Weight']>145

print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

In [78]:
print("\nRows with Height > 65 inch and Weight >145 lbs\n",'-'*55, sep='')
print(df[(booldf1) & (booldf2)])

Rows with Height > 65 inch and Weight >145 lbs
-------------------------------------------------------
   Age  Height  Weight
B   42      70     148
D   35      68     160

In [79]:
print("\nDataFrame with only Age and Weight columns whose Height > 65 inch\n",'-'*68, sep='')
print(df[booldf1][['Age','Weight']])

DataFrame with only Age and Weight columns whose Height > 65 inch
--------------------------------------------------------------------
   Age  Weight
A   22     140
B   42     148
D   35     160

In [80]:
matrix_data = np.matrix('22,66,140;42,70,148;30,62,125;35,68,160;25,62,152')
row_labels = ['A','B','C','D','E']
column_headings = ['Age', 'Height', 'Weight']

df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

In [81]:
df = pd.DataFrame(data=matrix_data, index=row_labels, columns=column_headings)
print("\nThe DataFrame\n",'-'*25, sep='')
print(df)

The DataFrame
-------------------------
   Age  Height  Weight
A   22      66     140
B   42      70     148
C   30      62     125
D   35      68     160
E   25      62     152

In [82]:
print("\nAfter resetting index\n",'-'*35, sep='')
print(df.reset_index())

After resetting index
-----------------------------------
  index  Age  Height  Weight
0     A   22      66     140
1     B   42      70     148
2     C   30      62     125
3     D   35      68     160
4     E   25      62     152

In [83]:
print("\nAfter resetting index with 'drop' option TRUE\n",'-'*45, sep='')
print(df.reset_index(drop=True))
"Student Teacher Engineer Doctor Nurse".split()

After resetting index with 'drop' option TRUE
---------------------------------------------
   Age  Height  Weight
0   22      66     140
1   42      70     148
2   30      62     125
3   35      68     160
4   25      62     152

['Student', 'Teacher', 'Engineer', 'Doctor', 'Nurse']

In [84]:
print("\nAdding a new column 'Profession'\n",'-'*45, sep='')
df['Profession'] = "Student Teacher Engineer Doctor Nurse".split()
print(df)

Adding a new column 'Profession'
---------------------------------------------
   Age  Height  Weight Profession
A   22      66     140    Student
B   42      70     148    Teacher
C   30      62     125   Engineer
D   35      68     160     Doctor
E   25      62     152      Nurse

In [85]:
print("\nSetting 'Profession' column as index\n",'-'*45, sep='')
print (df.set_index('Profession'))

Setting 'Profession' column as index
---------------------------------------------
            Age  Height  Weight
Profession
Student      22      66     140
Teacher      42      70     148
Engineer     30      62     125
Doctor       35      68     160
Nurse        25      62     152

In [86]:
#multi-indexing
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))

print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

#cross tabulation like pivot table
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

In [87]:
print("\nTuple pairs after the zip and list command\n",'-'*45, sep='')
print(hier_index)

Tuple pairs after the zip and list command
---------------------------------------------
[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [88]:
hier_index = pd.MultiIndex.from_tuples(hier_index)
print("\nIndex hierarchy\n",'-'*25, sep='')
print(hier_index)

Index hierarchy
-------------------------
MultiIndex(levels=[['G1', 'G2'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1], [0, 1, 2, 0, 1, 2]])

In [89]:
print("\nIndex hierarchy type\n",'-'*25, sep='')
print(type(hier_index))

Index hierarchy type
-------------------------
<class 'pandas.core.indexes.multi.MultiIndex'>

In [90]:
print("\nCreating DataFrame with multi-index\n",'-'*37, sep='')
#np.random.seed(101)
df1 = pd.DataFrame(data=np.round(rn(6,3)), index= hier_index, columns= ['A','B','C'])
print(df1)

Creating DataFrame with multi-index
-------------------------------------
        A    B    C
G1 1 -0.0  1.0 -0.0
   2  2.0 -1.0  0.0
   3 -0.0 -0.0  1.0
G2 1  0.0 -1.0  0.0
   2  1.0  0.0  1.0
   3  0.0 -1.0 -0.0

In [91]:
#cross tabulation like pivot table
print("\nGrabbing a cross-section from outer level\n",'-'*45, sep='')
print(df1.xs('G1'))

Grabbing a cross-section from outer level
---------------------------------------------
     A    B    C
1 -0.0  1.0 -0.0
2  2.0 -1.0  0.0
3 -0.0 -0.0  1.0